import React from 'react'
import{motion} from 'framer-motion'
function Php() {
  return (
    <motion.div className='php'
    intial={{opacity:0}}
      animate={{opacity:1}}
      exit={{opacity:0}}
    >
      <h2>PHPزبان برنامه نویسی</h2>
      <p>یک زبان برنامه نویسی اوپن سورسه که با قابلیت توسعه داخلی وب ساخته شده و امروزه به‌طور گسترده‌ توسط برنامه نویسان وب استفاده می‌شه. اسکریپت این زبان روی سرور اجرا میشه. این زبان به قدری قدرتمند و شگفت انگیزه که در هستۀ بزرگترین سیستم وبلاگ‌نویسی یعنی وردپرس قرار گرفته. شرکت‌های بزرگی همچون فیس‌بوک، یاهو و ویکی‌پدیا هم از اون استفاده می‌کنن. این زبان برای یادگیری مبتدیان علاقه‌مند به برنامه‌نویسی سمت سرور به اندازۀ کافی ساده و آسونه!</p>
    </motion.div>
  )
}

export default Php
