import React from 'react'
import{motion} from 'framer-motion'
function Python() {
  return (
    <motion.div className='python'
    intial={{opacity:0}}
    animate={{opacity:1}}
    exit={{opacity:0}}
    >
        <h2>Pythonزبان برنامه نویسی</h2>
        <p>
        یکی از زبان برنامه نویسی شی گرا است که در سال ۱۹۹۱ منتشر شده است. تنوع پایتون، سازگاری، یادگیری اصول اولیه آسان‌تر آن را از دیگر زبان‌های برنامه‌نویسی جدا کرده است. از آنجا که شرکت بزرگ گوگل، این زبان را به یکی از زبان‌های برنامه‌نویسی رسمی خود تبدیل کرده‌اند، موجب شده تا این زبان در سراسر جهان از اهمیت ویژه ای برخوردار باشد و روند رو به رشدی را در سال‌های اخیر طی کند. برنامه‌نویسی این زبان از نظر محبوبیت هم‌اکنون در رتبۀ دوم جای دارد که نشان از پیشرفت روز افزون این زبان در بین جامعۀ برنامه‌نویسان است. همچنین کتابخانه‌های وسیع و جامعۀ فعال این زبان باعث شده تا پایتون به عنوان دومین زبان برنامه نویسی مورد علاقه هکرها تبدیل شود.


        </p>
      
    </motion.div>
  )
}

export default Python
